import React, { PureComponent } from 'react';
import styles from './Description.module.css';
import poster from './poster.jpg';

class Description extends PureComponent {
  render() {
    return (
      <section className={`wrapper ${styles.decriptionSection}`}>
        <div className={styles.imageBox}>
          <img className={styles.posterImage} src={poster} alt="UIAI2 Poster" />
        </div>

        <div className={styles.textBox}>
          <p>حوزه‌ی هوش مصنوعی، امروزه از پیشرفته‌ترین و پرطرفدارترین حوزه‌های علوم کامپیوتر است که خوشبختانه در کشور ما نیز چند سالی است در این زمینه فعالیت‌هایی صورت گرفته است. بنابراین برگزاری مسابقات هوش مصنوعی می‌تواند راهکاری برای معرفی به دانشجویان، گسترش مشتاقان و همچنین شناسایی نخبگان این حوزه باشد. از این رو، سال گذشته انجمن علمیACM  دوره‌ی اول مسابقات هوش مصنوعی دانشگاه اصفهان را تحت عنوان چالش دوز ۲۴تایی برگزار نمود که با استقبال خوبی از سوی دانشجویان دانشگاه‌های برتر کشور از قبیل دانشگاه صنعتی شریف، علم و صنعت، صنعتی اصفهان و ... روبه‌رو شد.</p>

          <p>
            امسال نیز انجمن علمی ACM دانشکده‌ی مهندسی کامپیوتر و مرکز بازی سازی دانشگاه اصفهان درتلاشند تا دومین دوره این مسابقات را باشکوه‌تر از سال گذشته برگزار نمایند. این دوره از مسابقات با نام مینی فوتبال که مانند بازی soccer stars شبیه‌سازی شده‌ است، بر جذابیت هر چه بیشتر این رقابت‌ها می‌افزاید. روال این چالش به گونه‌ای طراحی شده‌است که کدهای هوشمند تیم‌های شرکت کننده، با یکدیگر به رقابت می‌پردازند.
          </p>
        </div>
      </section>
    );
  }
}

export default Description;
